//*****************************************************************************
//
// パーティクルの元となるcppファイル
//
//*****************************************************************************

#define _USING_V110_SDK71_ 1

//ヘッダファイル名を書き換えて使用します
#include "ParticleSource.h"

using namespace KeyString;
using namespace InputKey;
using namespace WindowSetting;

//-----------------------------------------------------------------------------
// クラスメンバの本体を書きます。
//-----------------------------------------------------------------------------

//=============================================================================
// コンストラクタ
//=============================================================================
ParticleSource::ParticleSource()
{

}

//=============================================================================
// デストラクタ
//=============================================================================
ParticleSource::~ParticleSource()
{

}

//=============================================================================
// 初期化
// 引　数：Engine* エンジンクラスのアドレス
// 　　　　const D3DXVECTOR3 位置
// 　　　　const DWORD       存在時間
//=============================================================================
void ParticleSource::Initialize(Engine* pEngine, const D3DXVECTOR3 position, const DWORD existTime)
{
	m_position = position;
	m_generateTime = timeGetTime();
	m_existTime = existTime;
	m_bExist = true;

	//サイズとテクスチャの設定

}

//=============================================================================
// 更新
//=============================================================================
void ParticleSource::Update()
{
	//更新（存在チェック）
	ParticleBase::Update();
}


