//*****************************************************************************
//
// シーンの基底クラス
//
// Scene.cpp
//
// K_Yamaoka
//
// 2016/11/16
//
// 2020/08/27 背景色の変更を追加
//
// 2021/04/13 ImGuiテスト用関数を追加
//
// 2021/10/07 GetNowScene関数を追加
//
// 2021/12/01 PostEffect関数を追加
//
//*****************************************************************************

#define _USING_V110_SDK71_ 1

#include "Scene.h"

//シーン構造体
SceneData Scene::m_nowSceneData;
SceneData Scene::m_prevSceneData;

//サブシーンのためのスタック
std::stack<SceneData> Scene::m_stkScene;

//複数のシーンで共用するデータ構造体
Common::CommonData Scene::m_gameData;

//=============================================================================
// コンストラクタ
//=============================================================================
SceneData::SceneData()
{

}

//=============================================================================
// データのセット
// 引　数：const int    シーン定数
// 　　　　const bool   サブシーンかどうか
// 　　　　const Scene* サブシーンへ飛ぶ場合に前のシーンのポインタを格納する
//=============================================================================
void SceneData::Set(const int scene, const bool bSubScene, Scene* const pPrevScene)
{
	m_scene = scene;
	m_bSubScene = bSubScene;
	m_pPrevScene = pPrevScene;
}

//=============================================================================
// 現在のシーンの取得
// 戻り値：int シーン定数
//=============================================================================
int SceneData::GetNowScene() const
{
	return m_scene;
}


//=============================================================================
// コンストラクタ
// 引　数：Engine* エンジンクラスのアドレス
//=============================================================================
Scene::Scene(Engine *pEngine)
	: m_pEngine(pEngine)
	, m_bStart(true)
	, m_bEnd(false)
	, m_backColor(0x00000000)
{

}

//=============================================================================
// 仮想デストラクタ
//=============================================================================
Scene::~Scene()
{
	Exit();
}

//=============================================================================
// Run関数内で実行される終了処理用関数（純粋仮想関数）
//=============================================================================
void Scene::Exit()
{

}

#ifdef USE_IMGUI
//=============================================================================
// Run関数内で実行されるImGuiフレーム処理用関数（仮想関数）
//=============================================================================
void Scene::ImGuiFrameProcess()
{

}
#endif

//=============================================================================
// サブシーンから戻った際に終了フラグを戻す関数
// 備　考：Game.cppのRun関数内でしか使わないので呼び出さない事
//=============================================================================
void Scene::ReturnSubScene()
{
	m_bEnd = false;
}

//=============================================================================
// シーン処理の実行
//=============================================================================
bool Scene::Run()
{
	if (m_bStart) {
		Start();
		m_bStart = false;
	}

	Input();

	SoundManager::Update();
	Update();

	if (m_nowSceneData.m_scene != m_prevSceneData.m_scene) {
		m_bEnd = true;
		return m_bEnd;
	}

	m_pEngine->Clear(m_backColor);

#ifdef USE_IMGUI
	m_pEngine->BeginFrame();

	ImGuiFrameProcess();

	m_pEngine->EndFrame();
#endif

	m_pEngine->BeginScene();

	Draw();

	m_pEngine->EndScene();

	PostEffect();
	
	m_pEngine->Present();

	if (m_nowSceneData.m_scene != m_prevSceneData.m_scene) {
		m_bEnd = true;
	}

	return m_bEnd;
}

//-----------------------------------------------------------------------------
// 背景色のセット
// 引　数：D3DCOLOR 背景色
//-----------------------------------------------------------------------------
void Scene::SetBackColor(D3DCOLOR color)
{
	m_backColor = color;
}

//-----------------------------------------------------------------------------
// Run関数内で入力デバイスの状態を更新する
//-----------------------------------------------------------------------------
void Scene::Input()
{
	m_pEngine->UpdateInputDeviceState();
}
