//*****************************************************************************
//
// 時間間隔管理クラス
//
// IntervalManage.cpp
//
// K_Yamaoka
//
// 2012/06/18
//
// 2014/10/24　コンストラクタ、ResetInterval関数、関数説明の追加
//
// 2021/01/18　GetTiming関数を変更（m_intervalが０の時はfalseを返す）
//
//*****************************************************************************

#define _USING_V110_SDK71_ 1

#include "IntervalManage.h"

//=============================================================================
// コンストラクタ
//=============================================================================
IntervalManage::IntervalManage()
	: m_interval(0)
{

}

//=============================================================================
// 計測間隔時間の設定
// 引　数：計測間隔時間（ミリ秒）
//=============================================================================
void IntervalManage::SetInterval(const DWORD interval)
{
	m_interval = interval;

	m_start = timeGetTime();
}

//=============================================================================
// 設定した計測間隔時間に達したかどうか調べる
// 戻り値：true 経過した、false 経過していない
//=============================================================================
bool IntervalManage::GetTiming()
{
	if (m_interval > 0) {

		m_now = timeGetTime();

		m_pass = m_now - m_start;

		if (m_pass >= m_interval) {

			m_start = m_now;

			return true;
		}
	}

	return false;
}

//=============================================================================
// 計測間隔時間のリセット
//=============================================================================
void IntervalManage::ResetInterval()
{
	m_interval = 0;
}


























