//*****************************************************************************
//
// 行列サポートクラス
//
// Matrix.h
//
// K_Yamaoka
//
// 2013/06/04
//
// 2014/10/24　関数説明追加
//
//*****************************************************************************

#pragma once

#include <d3dx9.h>

//=============================================================================
// 平行移動行列の作成
// 戻り値：D3DXMATRIX*　 pOutと同じｱﾄﾞﾚｽ(戻り値を別の関数引数として使える）
// 引　数：D3DXMATRIX*　 作成する行列構造体のアドレス
// 　　　　D3DXVECTOR3*　元となるベクトルのアドレス
//=============================================================================
D3DXMATRIX* D3DXMatrixTranslation(D3DXMATRIX* pOut, const D3DXVECTOR3* pV);

//=============================================================================
// 拡大縮小行列の作成
// 戻り値：D3DXMATRIX*　pOutと同じｱﾄﾞﾚｽ(戻り値を別の関数引数として使える）
// 引　数：D3DXMATRIX*　作成する行列構造体のアドレス
// 　　　　const FLOAT　拡大・縮小率(X,Y,Z方向共に等しくｻｲｽﾞ変更される)
//=============================================================================
D3DXMATRIX* D3DXMatrixScaling(D3DXMATRIX* pOut, const FLOAT s);
