//*****************************************************************************
//
// クラスの元となるcppファイル
//
//*****************************************************************************

#define _USING_V110_SDK71_ 1

//ヘッダファイル名を書き換えて使用します
#include "ObjectSource.h"

using namespace KeyString;
using namespace InputKey;
using namespace WindowSetting;
using namespace Common;

//-----------------------------------------------------------------------------
// クラスメンバの本体を書きます。
//-----------------------------------------------------------------------------

