//*****************************************************************************
//
// アンビエントライトクラス
//
// Ambient.h
//
// K_Yamaoka
//
// 2013/03/04
//
// 2020/08/24 SetColor（引数をfloatにしたもの）、GetColorVector関数を追加
//
// 2020/08/27 色の設定にアルファを加えた、GetColorVectorをGetColorValueに変更
//
//*****************************************************************************

#pragma once

#include <d3dx9.h>

#include "..\\Engine.h"

class AmbientLight
{
public:

	//=============================================================================
	// コンストラクタ
	//=============================================================================
	AmbientLight();

	//=============================================================================
	// コンストラクタ
	// 引　数：const D3DCOLOR ディフューズ色
	//=============================================================================
	AmbientLight(const D3DCOLOR diffuse);

	//=============================================================================
	// コンストラクタ
	// 引　数：const BYTE アルファ（０～２５５）
	// 　　　　const BYTE 赤（０～２５５）
	// 　　　　const BYTE 緑（０～２５５）
	// 　　　　const BYTE 青（０～２５５）
	//=============================================================================
	AmbientLight(const BYTE a, const BYTE r, const BYTE g, const BYTE b);

	//=============================================================================
	// ディフューズ色の設定
	// 引　数：const D3DCOLOR ディフューズ色
	//=============================================================================
	void SetColor(const D3DCOLOR diffuse);

	//=============================================================================
	// ディフューズ色の設定
	// 引　数：const BYTE アルファ（０～２５５）
	// 　　　　const BYTE 赤（０～２５５）
	// 　　　　const BYTE 緑（０～２５５）
	// 　　　　const BYTE 青（０～２５５）
	//=============================================================================
	void SetColor(const BYTE a, const BYTE r, const BYTE g, const BYTE b);

	//=============================================================================
	// ディフューズ色の設定
	// 引　数：const float アルファ（０～１．０）
	// 　　　　const float 赤（０～１．０）
	// 　　　　const float 緑（０～１．０）
	// 　　　　const float 青（０～１．０）
	//=============================================================================
	void SetColor(const float a, const float r, const float g, const float b);

	//=============================================================================
	// ディフューズ色の取得
	// 戻り値：D3DCOLOR ディフューズ色
	//=============================================================================
	D3DCOLOR GetColor() const;

	//=============================================================================
	// ディフューズ色の取得
	// 戻り値：D3DCOLORVALUE ディフューズ色
	//=============================================================================
	D3DCOLORVALUE GetColorValue() const;

	//=============================================================================
	// デバイスへセット
	// 引　数：Engine* ３Ｄエンジンクラスへのポインタ
	//=============================================================================
	void SetDevice(Engine* pEngine);

private:

	//ディフューズ色
	D3DCOLOR m_diffuse;
};









































