//*****************************************************************************
//
// スポットライトクラス
//
// Spot.h
//
// K_Yamaoka
//
// 2013/06/18
//
// 2020/08/27 色の設定にアルファを加えた
//
// 2020/09/04 シェーダーに対応していないため使用不可
//
//*****************************************************************************

#pragma once

#include <d3dx9.h>

#include "..\\Engine.h"

class SpotLight
{
public:

	//=============================================================================
	// コンストラクタ
	//=============================================================================
	SpotLight();

	//=============================================================================
	// コンストラクタ
	// 引　数：const D3DLIGHT9* ライト構造体へのポインタ
	//=============================================================================
	SpotLight(const D3DLIGHT9* pLight);

	//=============================================================================
	// ライトの設定
	// 引　数：const D3DLIGHT9* ライト構造体へのポインタ
	//=============================================================================
	void SetLight(const D3DLIGHT9* pLight);

	//=============================================================================
	// ディフューズ色の設定
	// 引　数：const float アルファ（０～１．０）
	// 　　　　const float 赤（０～１．０）
	// 　　　　const float 緑（０～１．０）
	// 　　　　const float 青（０～１．０）
	//=============================================================================
	void SetDiffuse(const float a, const float r, const float g, const float b);

	//=============================================================================
	// アンビエント色の設定
	// 引　数：const float アルファ（０～１．０）
	// 　　　　const float 赤（０～１．０）
	// 　　　　const float 緑（０～１．０）
	// 　　　　const float 青（０～１．０）
	//=============================================================================
	void SetAmbient(const float a, const float r, const float g, const float b);

	//=============================================================================
	// 位置の設定
	// 引　数：const D3DXVECTOR3* 位置ベクトルへのポインタ
	//=============================================================================
	void SetPosition(const D3DXVECTOR3* pVecPosition);

	//=============================================================================
	// 位置の設定
	// 引　数：const D3DXVECTOR3 位置ベクトル
	//=============================================================================
	void SetPosition(const D3DXVECTOR3& vecPosition);

	//=============================================================================
	// 方向の設定
	// 引　数：const D3DXVECTOR3* 方向ベクトルへのポインタ（単位ベクトル）
	//=============================================================================
	void SetDirection(const D3DXVECTOR3* pVecDirection);

	//=============================================================================
	// 方向の設定
	// 引　数：const D3DXVECTOR3 方向ベクトル（単位ベクトル）
	//=============================================================================
	void SetDirection(const D3DXVECTOR3& vecDirection);

	//=============================================================================
	// 範囲の設定
	// 引　数：const float 範囲
	//=============================================================================
	void SetRange(const float range);

	//=============================================================================
	// 減衰の設定
	// 引　数：const float 定常減衰係数
	//         const float 線形減衰係数
	//         const float 平方減衰係数
	//=============================================================================
	void SetAttenuation(const float attenuation0, const float attenuation1, const float attenuation2);

	//=============================================================================
	// コーンの設定
	// 引　数：const float 減衰（内側から外側へ）
	// 　　　　const float 内側の円の角度（ラジアン角）
	// 　　　　const float 外側の円の角度（ラジアン角）
	//=============================================================================
	void SetCone(const float falloff, const float theta, const float phi);

	//=============================================================================
	// ライト構造体の取得
	// 戻り値：D3DLIGHT9 ライト構造体
	//=============================================================================
	D3DLIGHT9 GetLight() const;

	//=============================================================================
	// デバイスへセット
	// 引　数：Engine*   ３Ｄエンジンクラスへのポインタ
	// 　　　　const int ライトインデックス
	//=============================================================================
	void SetDevice(Engine* pEngine, const int index);

	//=============================================================================
	// ライトを消す
	// 引　数：Engine*   ３Ｄエンジンクラスへのポインタ
	//=============================================================================
	void Off(Engine* pEngine);

	//=============================================================================
	// ライトを再点灯（Off後に使用）
	// 引　数：Engine*   ３Ｄエンジンクラスへのポインタ
	//=============================================================================
	void On(Engine* pEngine);

	float GetAngle()const;
	float GetRange()const;
	
	D3DXVECTOR3 GetDirection();
private:

	const int NOTSETDEVICE;

	//ライト構造体
	D3DLIGHT9 m_light;

	//ライトインデックス
	int m_index;
};







































